In [1]:
import pandas as pd
import numpy as np

In [2]:
CCTV_seoul = pd.read_csv('01. CCTV_in_Seoul.csv', encoding = 'utf-8')
CCTV_seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [3]:
CCTV_seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [4]:
CCTV_seoul.columns[0]

'기관명'

In [5]:
CCTV_seoul.rename(columns={CCTV_seoul.columns[0] : '구별'}, inplace=True)
CCTV_seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [6]:
pop_seoul = pd.read_excel('01. population_in_Seoul.xls',encoding = 'utf-8')
pop_seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [7]:
pop_seoul = pd.read_excel('01. population_in_Seoul.xls',
                          header = 2,
                          usecols = 'B, D, G, J, N',
                          encoding = 'utf-8')
pop_seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [8]:
pop_seoul.rename(columns={pop_seoul.columns[0] : '구별',
                          pop_seoul.columns[1] : '인구수',
                          pop_seoul.columns[2] : '한국인',
                          pop_seoul.columns[3] : '외국인',
                          pop_seoul.columns[4] : '고령자'}, inplace = True )
pop_seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [10]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [16]:
datas = pd.date_range('20130101', periods =6)
datas

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df = pd.DataFrame(np.random.randn(6,4), index=datas, columns = ['A','B','C','D'])
df

                   A         B         C         D
2013-01-01  0.466518  0.729686 -0.053330 -0.854681
2013-01-02 -0.786147 -1.356433  0.081228  1.023560
2013-01-03 -0.275225  0.485208 -0.840430 -0.896398
2013-01-04  0.490641  0.681112  0.742514  0.747644
2013-01-05  1.235788  0.229357  0.389488  0.754566
2013-01-06 -1.168411 -2.056249  0.571886  0.909198

In [18]:
df.head(3)

                   A         B         C         D
2013-01-01  0.466518  0.729686 -0.053330 -0.854681
2013-01-02 -0.786147 -1.356433  0.081228  1.023560
2013-01-03 -0.275225  0.485208 -0.840430 -0.896398

In [19]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df.values

array([[ 0.46651835,  0.72968622, -0.05332951, -0.8546814 ],
       [-0.78614667, -1.35643332,  0.08122779,  1.02355966],
       [-0.27522519,  0.48520843, -0.84043037, -0.89639759],
       [ 0.49064068,  0.68111164,  0.74251394,  0.74764363],
       [ 1.23578772,  0.22935675,  0.38948804,  0.75456578],
       [-1.16841087, -2.05624854,  0.57188608,  0.90919752]])

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.006139 -0.214553  0.148559  0.280648
std    0.899363  1.189643  0.568054  0.901564
min   -1.168411 -2.056249 -0.840430 -0.896398
25%   -0.658416 -0.959986 -0.019690 -0.454100
50%    0.095647  0.357283  0.235358  0.751105
75%    0.484610  0.632136  0.526287  0.870540
max    1.235788  0.729686  0.742514  1.023560

In [25]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2013-01-01  0.466518  0.729686 -0.053330 -0.854681
2013-01-04  0.490641  0.681112  0.742514  0.747644
2013-01-03 -0.275225  0.485208 -0.840430 -0.896398
2013-01-05  1.235788  0.229357  0.389488  0.754566
2013-01-02 -0.786147 -1.356433  0.081228  1.023560
2013-01-06 -1.168411 -2.056249  0.571886  0.909198

In [26]:
df

                   A         B         C         D
2013-01-01  0.466518  0.729686 -0.053330 -0.854681
2013-01-02 -0.786147 -1.356433  0.081228  1.023560
2013-01-03 -0.275225  0.485208 -0.840430 -0.896398
2013-01-04  0.490641  0.681112  0.742514  0.747644
2013-01-05  1.235788  0.229357  0.389488  0.754566
2013-01-06 -1.168411 -2.056249  0.571886  0.909198

In [27]:
df['A']

2013-01-01    0.466518
2013-01-02   -0.786147
2013-01-03   -0.275225
2013-01-04    0.490641
2013-01-05    1.235788
2013-01-06   -1.168411
Freq: D, Name: A, dtype: float64

In [28]:
df.loc[dates[0]] # loc = location 위치값 지정 가능

A    0.466518
B    0.729686
C   -0.053330
D   -0.854681
Name: 2013-01-01 00:00:00, dtype: float64

### loc(location)위치값 지정 가능
 
 - 행, 열 범위 모두 지정 가능 
 - row,columns의 이름으로 접근해야한다
 - 변수명.loc[row명,columns명]

In [29]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.786147 -1.356433
2013-01-03 -0.275225  0.485208
2013-01-04  0.490641  0.681112

In [30]:
df.loc['20130102',['A','B']]

A   -0.786147
B   -1.356433
Name: 2013-01-02 00:00:00, dtype: float64

### iloc 

 - 행과 열의 번호로 데이터 접근이 가능
 - ' : '을 사용하면 전체를 의미한다
 - 변수명.iloc[row명,columns명]

In [31]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.490641  0.681112
2013-01-05  1.235788  0.229357

In [32]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.786147  0.081228
2013-01-03 -0.275225 -0.840430
2013-01-05  1.235788  0.389488

In [34]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.466518  0.729686 -0.053330 -0.854681
2013-01-04  0.490641  0.681112  0.742514  0.747644
2013-01-05  1.235788  0.229357  0.389488  0.754566

In [37]:
 df['A'] > 0

2013-01-01     True
2013-01-02    False
2013-01-03    False
2013-01-04     True
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

df[df.A > 0] = df['A'] > 0 -- 이건 bool형으로 나옴

데이터 조건에 만족하지 않는 곳은 NaN처리가 된다

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.466518  0.729686       NaN       NaN
2013-01-02       NaN       NaN  0.081228  1.023560
2013-01-03       NaN  0.485208       NaN       NaN
2013-01-04  0.490641  0.681112  0.742514  0.747644
2013-01-05  1.235788  0.229357  0.389488  0.754566
2013-01-06       NaN       NaN  0.571886  0.909198

In [39]:
df2 = df.copy()

변수명.copy() - 데이터 내용까지 복사하는 copy()

In [42]:
df2['E'] = ['one', 'one','two','three','four','three'] # 새로운 cloumns 생성 
df2

                   A         B         C         D      E
2013-01-01  0.466518  0.729686 -0.053330 -0.854681    one
2013-01-02 -0.786147 -1.356433  0.081228  1.023560    one
2013-01-03 -0.275225  0.485208 -0.840430 -0.896398    two
2013-01-04  0.490641  0.681112  0.742514  0.747644  three
2013-01-05  1.235788  0.229357  0.389488  0.754566   four
2013-01-06 -1.168411 -2.056249  0.571886  0.909198  three

새로운 cloumns 생성

In [46]:
df2['E'].isin(['two','four'])#two 와 four 이 있는지 확인하기

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [47]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.275225  0.485208 -0.840430 -0.896398   two
2013-01-05  1.235788  0.229357  0.389488  0.754566  four

df2['E'].isin(['two','four'])<br>
df[]를 하나 더 씌우면 결과에 대한 dataframe이 나온다

In [48]:
df

                   A         B         C         D
2013-01-01  0.466518  0.729686 -0.053330 -0.854681
2013-01-02 -0.786147 -1.356433  0.081228  1.023560
2013-01-03 -0.275225  0.485208 -0.840430 -0.896398
2013-01-04  0.490641  0.681112  0.742514  0.747644
2013-01-05  1.235788  0.229357  0.389488  0.754566
2013-01-06 -1.168411 -2.056249  0.571886  0.909198

In [49]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.466518  0.729686 -0.053330 -0.854681
2013-01-02 -0.319628 -0.626747  0.027898  0.168878
2013-01-03 -0.594854 -0.141539 -0.812532 -0.727519
2013-01-04 -0.104213  0.539573 -0.070018  0.020124
2013-01-05  1.131575  0.768930  0.319470  0.774690
2013-01-06 -0.036836 -1.287319  0.891356  1.683888

### 통계적인 느낌의 데이터에 대한 특정함수 적용
## apply

 - 누적합알아보기 : 변수명.apply(np.cumsum)
 - 최대값-최소값차이(거리) 알아보기 -> one-line함수인 lambda를 이용가능 : 변수명.apply(lambda x : x.max() - x.min())

In [50]:
df.apply(lambda x : x.max() - x.min())

A    2.404199
B    2.785935
C    1.582944
D    1.919957
dtype: float64